RIOT-OS/RIOT/cpu/efm32/families/efr32zg23/include/vendor/efr32zg23_lesense.h
/* Bit fields for LESENSE CH_EVALCFG */
#define _LESENSE_CH_EVALCFG_RESETVALUE               0x00000000UL                                  /**< Default value for LESENSE_CH_EVALCFG        */
#define _LESENSE_CH_EVALCFG_MASK                     0x0000037CUL                                  /**< Mask for LESENSE_CH_EVALCFG                 */
#define LESENSE_CH_EVALCFG_DECODE                    (0x1UL << 2)                                  /**< Send result to decoder                      */
#define _LESENSE_CH_EVALCFG_DECODE_SHIFT             2                                             /**< Shift value for LESENSE_DECODE              */
#define _LESENSE_CH_EVALCFG_DECODE_MASK              0x4UL                                         /**< Bit mask for LESENSE_DECODE                 */
#define _LESENSE_CH_EVALCFG_DECODE_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for LESENSE_CH_EVALCFG         */
#define LESENSE_CH_EVALCFG_DECODE_DEFAULT            (_LESENSE_CH_EVALCFG_DECODE_DEFAULT << 2)     /**< Shifted mode DEFAULT for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_COMP                      (0x1UL << 3)                                  /**< Select mode for threshold comparison        */
#define _LESENSE_CH_EVALCFG_COMP_SHIFT               3                                             /**< Shift value for LESENSE_COMP                */
#define _LESENSE_CH_EVALCFG_COMP_MASK                0x8UL                                         /**< Bit mask for LESENSE_COMP                   */
#define _LESENSE_CH_EVALCFG_COMP_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for LESENSE_CH_EVALCFG         */
#define _LESENSE_CH_EVALCFG_COMP_LESS                0x00000000UL                                  /**< Mode LESS for LESENSE_CH_EVALCFG            */
#define _LESENSE_CH_EVALCFG_COMP_GE                  0x00000001UL                                  /**< Mode GE for LESENSE_CH_EVALCFG              */
#define LESENSE_CH_EVALCFG_COMP_DEFAULT              (_LESENSE_CH_EVALCFG_COMP_DEFAULT << 3)       /**< Shifted mode DEFAULT for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_COMP_LESS                 (_LESENSE_CH_EVALCFG_COMP_LESS << 3)          /**< Shifted mode LESS for LESENSE_CH_EVALCFG    */
#define LESENSE_CH_EVALCFG_COMP_GE                   (_LESENSE_CH_EVALCFG_COMP_GE << 3)            /**< Shifted mode GE for LESENSE_CH_EVALCFG      */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_SHIFT          4                                             /**< Shift value for LESENSE_STRSAMPLE           */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_MASK           0x30UL                                        /**< Bit mask for LESENSE_STRSAMPLE              */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_DEFAULT        0x00000000UL                                  /**< Mode DEFAULT for LESENSE_CH_EVALCFG         */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_DISABLE        0x00000000UL                                  /**< Mode DISABLE for LESENSE_CH_EVALCFG         */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_DATA           0x00000001UL                                  /**< Mode DATA for LESENSE_CH_EVALCFG            */
#define _LESENSE_CH_EVALCFG_STRSAMPLE_DATASRC        0x00000002UL                                  /**< Mode DATASRC for LESENSE_CH_EVALCFG         */
#define LESENSE_CH_EVALCFG_STRSAMPLE_DEFAULT         (_LESENSE_CH_EVALCFG_STRSAMPLE_DEFAULT << 4)  /**< Shifted mode DEFAULT for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_STRSAMPLE_DISABLE         (_LESENSE_CH_EVALCFG_STRSAMPLE_DISABLE << 4)  /**< Shifted mode DISABLE for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_STRSAMPLE_DATA            (_LESENSE_CH_EVALCFG_STRSAMPLE_DATA << 4)     /**< Shifted mode DATA for LESENSE_CH_EVALCFG    */
#define LESENSE_CH_EVALCFG_STRSAMPLE_DATASRC         (_LESENSE_CH_EVALCFG_STRSAMPLE_DATASRC << 4)  /**< Shifted mode DATASRC for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_SCANRESINV                (0x1UL << 6)                                  /**< Enable inversion of result                  */
#define _LESENSE_CH_EVALCFG_SCANRESINV_SHIFT         6                                             /**< Shift value for LESENSE_SCANRESINV          */
#define _LESENSE_CH_EVALCFG_SCANRESINV_MASK          0x40UL                                        /**< Bit mask for LESENSE_SCANRESINV             */
#define _LESENSE_CH_EVALCFG_SCANRESINV_DEFAULT       0x00000000UL                                  /**< Mode DEFAULT for LESENSE_CH_EVALCFG         */
#define LESENSE_CH_EVALCFG_SCANRESINV_DEFAULT        (_LESENSE_CH_EVALCFG_SCANRESINV_DEFAULT << 6) /**< Shifted mode DEFAULT for LESENSE_CH_EVALCFG */
#define _LESENSE_CH_EVALCFG_MODE_SHIFT               8                                             /**< Shift value for LESENSE_MODE                */
#define _LESENSE_CH_EVALCFG_MODE_MASK                0x300UL                                       /**< Bit mask for LESENSE_MODE                   */
#define _LESENSE_CH_EVALCFG_MODE_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for LESENSE_CH_EVALCFG         */
#define _LESENSE_CH_EVALCFG_MODE_THRES               0x00000000UL                                  /**< Mode THRES for LESENSE_CH_EVALCFG           */
#define _LESENSE_CH_EVALCFG_MODE_SLIDINGWIN          0x00000001UL                                  /**< Mode SLIDINGWIN for LESENSE_CH_EVALCFG      */
#define _LESENSE_CH_EVALCFG_MODE_STEPDET             0x00000002UL                                  /**< Mode STEPDET for LESENSE_CH_EVALCFG         */
#define LESENSE_CH_EVALCFG_MODE_DEFAULT              (_LESENSE_CH_EVALCFG_MODE_DEFAULT << 8)       /**< Shifted mode DEFAULT for LESENSE_CH_EVALCFG */
#define LESENSE_CH_EVALCFG_MODE_THRES                (_LESENSE_CH_EVALCFG_MODE_THRES << 8)         /**< Shifted mode THRES for LESENSE_CH_EVALCFG   */
#define LESENSE_CH_EVALCFG_MODE_SLIDINGWIN           (_LESENSE_CH_EVALCFG_MODE_SLIDINGWIN << 8)    /**< Shifted mode SLIDINGWIN for LESENSE_CH_EVALCFG*/
#define LESENSE_CH_EVALCFG_MODE_STEPDET              (_LESENSE_CH_EVALCFG_MODE_STEPDET << 8)       /**< Shifted mode STEPDET for LESENSE_CH_EVALCFG */

